let arr = [
	{ "xtcode": 1, "xtmc": "外部信息交换系统", "jd": 116.397449, "wd": 39.909193 },
	{ "xtcode": 2, "xtmc": "税务数字证书系统", "jd": 116.397439, "wd": 39.910353 },
	{ "xtcode": 3, "xtmc": "统一工作平台", "jd": 116.397246, "wd": 39.913616 },
	{ "xtcode": 4, "xtmc": "互联网邮箱系统", "jd": 116.397154, "wd": 39.91439 },
	{ "xtcode": 5, "xtmc": "全国电子底账库", "jd": 116.397171, "wd": 39.91527 },
	{ "xtcode": 6, "xtmc": "大数据云平台", "jd": 116.397058, "wd": 39.917307 },
	{ "xtcode": 7, "xtmc": "离境退税管理", "jd": 116.396993, "wd": 39.918418 },
	{ "xtcode": 8, "xtmc": "国际税收管理平台", "jd": 116.397015, "wd": 39.919274 },
	{ "xtcode": 9, "xtmc": "自然人税收管理系统", "jd": 116.396929, "wd": 39.92024 },
	{ "xtcode": 10, "xtmc": "出口退税管理系统", "jd": 116.396816, "wd": 39.921454 },
	{ "xtcode": 11, "xtmc": "电子发票公共服务平台", "jd": 116.396811, "wd": 39.922306 },
	{ "xtcode": 12, "xtmc": "学习兴税", "jd": 116.393984, "wd": 39.914398 },
	{ "xtcode": 13, "xtmc": "12366纳服平台", "jd": 116.392756, "wd": 39.91506 },
	{ "xtcode": 14, "xtmc": "异地协作平台（稽查协查）", "jd": 116.393984, "wd": 39.917373 },
	{ "xtcode": 15, "xtmc": "税警协作指挥管理平台系统", "jd": 116.394005, "wd": 39.918196 },
	{ "xtcode": 16, "xtmc": "企业所得税汇总纳税管理系统", "jd": 116.394386, "wd": 39.918632 },
	{ "xtcode": 17, "xtmc": "决策2包", "jd": 116.394413, "wd": 39.919051 },
	{ "xtcode": 18, "xtmc": "信息化运维服务质量评估管控平台", "jd": 116.393566, "wd": 39.919673 },
	{ "xtcode": 19, "xtmc": "多边税务数据服务平台", "jd": 116.393989, "wd": 39.919508 },
	{ "xtcode": 20, "xtmc": "决策1包", "jd": 116.395679, "wd": 39.919751 },
	{ "xtcode": 21, "xtmc": "企业所得税汇算清缴管理系统", "jd": 116.394773, "wd": 39.921076 },
	{ "xtcode": 22, "xtmc": "风险应对与实名办税监控系统", "jd": 116.393635, "wd": 39.921639 },
	{ "xtcode": 23, "xtmc": "综合办公系统", "jd": 116.392579, "wd": 39.92217 },
	{ "xtcode": 24, "xtmc": "多边服务平台", "jd": 116.396157, "wd": 39.921388 },
	{ "xtcode": 25, "xtmc": "个税电子税务局", "jd": 116.401151, "wd": 39.914534 },
	{ "xtcode": 26, "xtmc": "外网网站", "jd": 116.398576, "wd": 39.914633 },
	{ "xtcode": 27, "xtmc": "应用集成平台", "jd": 116.397916, "wd": 39.915377 },
	{ "xtcode": 28, "xtmc": "党建APP", "jd": 116.398447, "wd": 39.915423 },
	{ "xtcode": 29, "xtmc": "税务系统内部控制监督平台", "jd": 116.400421, "wd": 39.917792 },
	{ "xtcode": 30, "xtmc": "考勤系统", "jd": 116.400228, "wd": 39.918525 },
	{ "xtcode": 31, "xtmc": "绩效管理系统", "jd": 116.40048, "wd": 39.918825 },
	{ "xtcode": 32, "xtmc": "外部交换系统", "jd": 116.401108, "wd": 39.918669 },
	{ "xtcode": 33, "xtmc": "巡视巡查信息管理系统", "jd": 116.399016, "wd": 39.919224 },
	{ "xtcode": 34, "xtmc": "政府采购计划管理系统", "jd": 116.398061, "wd": 39.919652 },
	{ "xtcode": 35, "xtmc": "公务之家", "jd": 116.400362, "wd": 39.919483 },
	{ "xtcode": 36, "xtmc": "数字人事", "jd": 116.400362, "wd": 39.919973 },
	{ "xtcode": 37, "xtmc": "中央部门预算管理系统", "jd": 116.400373, "wd": 39.920335 },
	{ "xtcode": 38, "xtmc": "税务党建云", "jd": 116.397997, "wd": 39.920306 },
	{ "xtcode": 39, "xtmc": "内网网站", "jd": 116.398694, "wd": 39.92052 },
	{ "xtcode": 40, "xtmc": "财务内控信息化平台", "jd": 116.398023, "wd": 39.920771 },
	{ "xtcode": 41, "xtmc": "金税桑榆老干部信息化平台", "jd": 116.400802, "wd": 39.920755 },
	{ "xtcode": 42, "xtmc": "财务软件", "jd": 116.398994, "wd": 39.921693 },
	{ "xtcode": 43, "xtmc": "决算软件", "jd": 116.39974, "wd": 39.921866 },
	{ "xtcode": 44, "xtmc": "税务干部综合管理信息系统", "jd": 116.400277, "wd": 39.921343 }
];

let result = arr.map((item,index)=>{
	let obj = {"xtlx":"", "xtfl":"", "xtlxsj":"", "xtsxsj":"", "bscj":"", "xtljtzje":"", "yzdw":"", "ssdw":"", "jscs":"", "xtgnsl":"", "xtjksl":"", "xtsjl":"", "fwqsl01":"", "fwqsl02":"", "fwqsl03":""};
	for (let objKey in obj) {
		let m=1,n=100;
		let aNumber = (n+1- m) * Math.random() + m;
		obj[objKey] = Math.floor(aNumber);
	}
	item.icon = ++index + ".png";
	item.sx = obj;
	return item;
})

console.log(JSON.stringify(result));


